In [25]:
import pandas as pd
import numpy as np
from pandas import Series, DataFrame

from numpy.random import randn

In [15]:
npn = np.nan
dframe = DataFrame([[1,2,3,npn],[4,npn,6,7],[8,npn,9,npn],[10,npn,npn,npn]])

In [16]:
dframe

    0    1    2    3
0   1  2.0  3.0  NaN
1   4  NaN  6.0  7.0
2   8  NaN  9.0  NaN
3  10  NaN  NaN  NaN

In [19]:
dframe.dropna(thresh=2)

   0    1    2    3
0  1  2.0  3.0  NaN
1  4  NaN  6.0  7.0
2  8  NaN  9.0  NaN

In [21]:
dframe.fillna({0:0, 1:1, 2:2, 3:3})

    0    1    2    3
0   1  2.0  3.0  3.0
1   4  1.0  6.0  7.0
2   8  1.0  9.0  3.0
3  10  1.0  2.0  3.0

In [24]:
dframe.fillna(0, inplace=True)
dframe

    0    1    2    3
0   1  2.0  3.0  0.0
1   4  0.0  6.0  7.0
2   8  0.0  9.0  0.0
3  10  0.0  0.0  0.0

In [26]:
ser1 = Series(randn(6), index=[[1,1,1,2,2,2,],['a','b','c','a','b','c']])

In [27]:
ser1

1  a    1.087415
   b    0.716061
   c    1.345931
2  a   -0.251303
   b    1.183961
   c    0.908950
dtype: float64

In [28]:
ser1.index

MultiIndex(levels=[[1, 2], ['a', 'b', 'c']],
           labels=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [45]:
ser1[1,'b']

0.7160610669149264

In [46]:
dframe = ser1.unstack()

In [47]:
dframe

          a         b         c
1  1.087415  0.716061  1.345931
2 -0.251303  1.183961  0.908950